/*
Створи файл populate_db.sql, у якому напиши SQL для заповнення таблиць. Після виконання SQL БД має бути приведена у наступний стан:
 - додано щонайменше 10 працівників, мінімальна зарплата має бути менше за 1000, максимальна - більше за 5 000, мають бути всі технічні рівні (Trainee, Junior, Middle, Senior)
 - додано щонайменше 5 клієнтів
 - додано щонайменше 10 проєктів. Тривалість кожного проєкту (різниця START_DATE та FINISH_DATE) має бути від 1 до 100 місяців.
 - назначені працівники на кожен проєкт. Над кожним проєктом має працювати від 1 до 5 працівників.
*/

INSERT INTO worker (name, birthday, level, salary)
VALUES
('Alex', '1996-12-16', 'Junior', 750),
('Paul', '2005-01-11', 'Trainee', 550),
('Dmytro', '2006-07-23', 'Senior', 95750),
('Ostap', '1990-08-18', 'Middle', 55550),
('Kelvin', '2007-09-28', 'Middle', 35750),
('Nick', '1980-12-31', 'Junior', 999),
('Le', '2010-10-17', 'Junior', 857),
('Tomas', '2003-03-01', 'Junior', 356),
('Fred', '1984-02-29', 'Senior', 80000),
('Jhon', '1999-05-09', 'Middle', 25000);


INSERT INTO client (name)
VALUES
('Sigma'),
('Epam'),
('N-ix'),
('Facebook'),
('Amazon');

INSERT INTO project(name, client_id, start_date, finish_date)
VALUES
('Project A', 1, '2018-01-01', '2025-01-01'),
('Project B', 2, '2020-09-15', '2022-09-15'),
('Project C', 3, '2021-01-01', '2027-12-01'),
('Project D', 1, '2017-03-01', '2023-10-01'),
('Project E', 4, '2019-09-01', '2024-12-01'),
('Project F', 3, '2023-03-01', '2031-10-17'),
('Project G', 2, '2017-01-01', '2025-01-01'),
('Project H', 4, '2000-01-01', '2007-05-01'),
('Project I', 1, '2022-01-01', '2023-01-01'),
('Project J', 5, '2023-01-01', '2023-06-01');

INSERT INTO project_worker (project_id, worker_id)
VALUES
(1, 1),
(1, 7),
(1, 9),
(1, 10),
(2, 2),
(2, 3),
(2, 4),
(2, 7),
(3, 5),
(3, 6),
(3, 1),
(4, 8),
(4, 2),
(5, 3),
(5, 9),
(6, 1),
(7, 7),
(7, 8),
(7, 9),
(8, 10),
(9, 5),
(9, 10),
(10, 3);